{"@type":"Recipe","@context":"http://schema.org/","name":"Cream Puffs","keywords":"cream puffs","recipeCategory":"Dessert","recipeCuisine":"French","image":"https://images-gmi-pmc.edge-generalmills.com/eb9abad1-7853-4a38-8a04-f2c3f9678576.jpg","url": "https://www.bettycrocker.com/recipes/cream-puffs/f83fb235-2014-42c3-9676-c4848ed07f48","description":"These versatile and tender pastry puffs are stuffed with a traditional cream filling.  We also have many other tempting filler ideas for you.","recipeIngredient":["1  cup water","1/2  cup butter or margarine","1  cup Gold Medal™ all-purpose flour","4  eggs","1  package (4-serving size) vanilla instant pudding and pie filling mix","1  cup milk","1  teaspoon rum extract","1  teaspoon ground nutmeg","1/4  teaspoon ground ginger","2  cups whipping cream","  Powdered sugar","2  cups whipping cream","1/4  cup granulated or powdered sugar","1  teaspoon peppermint extract","5  or 6 drops red or green food color"],"totalTime":"PT1H55M","prepTime":"PT0H30M","recipeYield":"10","aggregateRating":{"@type":"AggregateRating","ratingValue":"4.5","ratingCount":"71","bestRating":"5","worstRating":"1"},"author":{"@type":"Person","name":"Betty Crocker Kitchens"},"recipeInstructions":[{"@type":"HowToStep","text":"Heat oven to 400°F. In 2 1/2-quart saucepan, heat water and butter to rolling boil. Stir in flour; reduce heat to low. Stir vigorously over low heat about 1 minute or until mixture forms a ball; remove from heat. Beat in eggs, all at once; continue beating until smooth."},{"@type":"HowToStep","text":"On ungreased cookie sheet, drop dough by slightly less than 1/4 cupfuls about 3 inches apart. Bake 35 to 40 minutes or until puffed and golden. Cool away from draft, about 30 minutes."},{"@type":"HowToStep","text":"Make one of the fillings (directions below). Cut off top third of each puff and pull out any strands of soft dough. Fill puffs with filling; replace tops. Cover; refrigerate until serving. Store covered in refrigerator. \r\nEggnog Fluff Filling: In large bowl, beat pudding mix, milk, rum extract, nutmeg and ginger with electric mixer on low speed until well blended. Add whipping cream; beat on high speed 1 to 2 minutes or until soft peaks form. Fill puffs. Serve immediately, or cover and refrigerate up to 3 hours. Just before serving, sprinkle with powdered sugar or brush tops with light corn syrup and sprinkle with colored sugar or nonpareils.  \r\nPeppermint Whipped Cream Filling: In large bowl, beat ingredients with electric mixer on high speed until stiff peaks form. Fill puffs. Serve immediately, or cover and refrigerate up to 4 hours."}],"nutrition":{"@type":"NutritionInformation","calories":"370  ","carbohydrateContent":"26  g","cholesterolContent":"165  mg","fiberContent":"0 g","proteinContent":"6  g","saturatedFatContent":"16  g","servingSize":"1 Serving","sodiumContent":"260  mg"},"dateCreated":"01/01/2004"}